# Task 09
"""
Завдання 1

Практика імпорту
 Створіть каталог із двома модулями; додайте функцію в один із них; потім імпортуйте
 цю функцію в інший модуль та використовуйте її у вибраному вами скрипті.
"""

# завантажимо функціі з mod_01
from mod_01 import circle_a, circle_l

# задамо радіус та виконаємо функцію
radius = 5
area = circle_a(radius)
# print(area)
# 2 знаки після коми
print(f"Площа круга з радіусом {radius} = {area:.2f}")

# підрахуємо довжину круга
length = circle_l(radius)
print(f"Довжина круга з радіусом {radius} = {length:.2f}")

# Площа круга з радіусом 5 = 78.65
# Довжина круга з радіусом 5 = 31.42
