# Task 08


#1
"""
Завдання 1

Проста функція.
Створіть просту функцію під назвою favorite_movie, яка приймає рядок,
що містить назву вашого улюбленого фільму. Потім функція повинна
вивести "Мій улюблений фільм називається {name}".
"""

def favorite_movie(name):
    print(f'Мій улюблений фільм називається {name}')
    return

favorite_movie('Mr.Robot')

# 2

"""
Створення словника.

Створіть функцію під назвою make_country, яка приймає назву 
країни та столицю як параметри. Потім створіть словник з цих 
двох параметрів, використовуючи «name» як ключ та «capital» 
як параметр. Змусьте функцію виводити значення словника, щоб 
переконатися, що він працює належним чином.
"""
def make_country(name, capital):
    country[name] = capital
    print(country)

country = {}
make_country('Іспанія', 'Мадрид')
make_country('Австрія', 'Відень')
make_country('Швейцарія', 'Берн')

# 3

"""
Простий калькулятор.

Створіть функцію з назвою make_operation, яка приймає 
простий арифметичний оператор як перший параметр (для 
спрощення нехай це буде лише '+', '-' або '*') та 
довільну кількість аргументів (лише числа) як другий 
параметр. Потім поверніть суму або добуток усіх чисел 
у довільному параметрі.

Наприклад:
виклик make_operation('+', 7, 7, 2) має повернути 16
виклик make_operation('-', 5, 5, -10, -20) має повернути 30
виклик make_operation('*', 7, 6) має повернути 42  
"""

def make_operation(operator, *args):

    result = args[0]


    for i in args[1:]:
        if operator == "+":
            result += i
        elif operator == "-":
            result -= i
        elif operator == "*":
            result *= i
        else:
            print("Enter => '+', '-' або '*'")

    print('result =', result)


make_operation('+',7, 7, 2 )
make_operation('-', 5, 5, -10, -20)
make_operation('*', 7, 6)



